app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 2]]
---
  def index
    @tasks = current_user.tasks.all

INSERT INTO "tasks" ("title", "details", "created_at", "updated_at", "completed", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "My first task"], ["details", "check up on Tolu"], ["created_at", "2022-04-20 12:02:20.526933"], ["updated_at", "2022-04-20 12:02:20.526933"], ["completed", 0], ["user_id", 2]]
---
  def create
    @task = current_user.tasks.build(task_params)
    if @task.save

UPDATE "tasks" SET "updated_at" = ?, "completed" = ? WHERE "tasks"."id" = ?  [["updated_at", "2022-04-18 11:48:08.788762"], ["completed", 1], ["id", 1]]
---
  def update
    #@task = Task.find(params[:id])
    if @task.update(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 4]]
---
  def destroy
    #@task = Task.find(params[:id])
    @task.destroy

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def load_task
    @task = Task.find(params[:id])